{
  "irVersion": 1,
  "generatedAt": "2026-06-01T09:00:00Z",
  "modules": [
    {
      "name": "ОбщийМодуль.Тесты",
      "ir": "ir/ОбщийМодуль.Тесты.ir.json",
      "results": "tests/ОбщийМодуль.Тесты.results.json"
    }
  ]
}
