{
  "irVersion": 1,
  "generator": { "tool": "handwritten", "version": "0.1" },
  "module": {
    "name": "Тесты.Объекты",
    "body": {
      "routines": [
        {
          "kind": "procedure",
          "name": "ПриИзмененииСуммы",
          "export": true,
          "params": [
            { "name": "Объект", "byRef": true }
          ],
          "body": [
            {
              "kind": "assign",
              "target": {
                "kind": "member",
                "object": { "kind": "variable", "name": "Объект" },
                "property": "НДС"
              },
              "expr": {
                "kind": "binary",
                "op": "Умножить",
                "left": {
                  "kind": "member",
                  "object": { "kind": "variable", "name": "Объект" },
                  "property": "Сумма"
                },
                "right": { "kind": "number", "value": 0.2 }
              }
            }
          ]
        },
        {
          "kind": "function",
          "name": "Тест_ЧтениеПоля",
          "export": false,
          "params": [],
          "body": [
            {
              "kind": "assign",
              "target": { "kind": "variable", "name": "x" },
              "expr": { "kind": "number", "value": 100 }
            },
            {
              "kind": "assign",
              "target": { "kind": "variable", "name": "obj" },
              "expr": {
                "kind": "new",
                "type": "Структура",
                "args": [
                  { "key": "Ключ", "value": { "kind": "variable", "name": "x" } }
                ]
              }
            },
            {
              "kind": "return",
              "value": {
                "kind": "member",
                "object": { "kind": "variable", "name": "obj" },
                "property": "Ключ"
              }
            }
          ]
        }
      ],
      "globals": []
    }
  }
}
