{
	"irVersion": 1,
	"generator": {
		"tool": "1C Exporter",
		"version": "0.1"
	},
	"module": {
		"name": "РаботаСоСправочниками",
		"body": {
			"routines": [
				{
					"kind": "function",
					"name": "РозничнаяЦена",
					"export": true,
					"params": [
						{
							"name": "АктуальнаяДата",
							"byRef": true
						},
						{
							"name": "ЭлементНоменклатуры",
							"byRef": true
						}
					],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Отбор"
							},
							"expr": {
								"kind": "new",
								"type": "Структура",
								"args": [
									{
										"key": "Номенклатура",
										"value": {
											"kind": "variable",
											"name": "ЭлементНоменклатуры"
										}
									}
								]
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "ЗначенияРесурсов"
							},
							"expr": {
								"kind": "call",
								"object": {
									"kind": "member",
									"object": {
										"kind": "variable",
										"name": "РегистрыСведений"
									},
									"property": "Цены"
								},
								"method": "ПолучитьПоследнее",
								"args": [
									{
										"kind": "variable",
										"name": "АктуальнаяДата"
									},
									{
										"kind": "variable",
										"name": "Отбор"
									}
								]
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "ЗначенияРесурсов"
								},
								"property": "Цена"
							}
						}
					]
				}
			],
			"globals": []
		}
	}
}