{
	"irVersion": 1,
	"generator": {
		"tool": "1C Exporter",
		"version": "0.1"
	},
	"module": {
		"name": "ТестыБлок3",
		"body": {
			"routines": [
				{
					"kind": "function",
					"name": "Тест_СтруктураВставить",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Стр"
							},
							"expr": {
								"kind": "new",
								"type": "Структура",
								"args": []
							}
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "Стр"
							},
							"method": "Вставить",
							"args": [
								{
									"kind": "string",
									"value": "Ключ"
								},
								{
									"kind": "number",
									"value": 123
								}
							]
						},
						{
							"kind": "return",
							"value": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Стр"
								},
								"property": "Ключ"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_СтруктураСвойство",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Стр"
							},
							"expr": {
								"kind": "new",
								"type": "Структура",
								"args": [
									{
										"key": "Ключ",
										"value": {
											"kind": "number",
											"value": 100
										}
									}
								]
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "call",
								"object": {
									"kind": "variable",
									"name": "Стр"
								},
								"method": "Свойство",
								"args": [
									{
										"kind": "string",
										"value": "Ключ"
									}
								]
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_МассивКоличество",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "М"
							},
							"expr": {
								"kind": "new",
								"type": "Массив",
								"args": []
							}
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 1
								}
							]
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 2
								}
							]
						},
						{
							"kind": "return",
							"value": {
								"kind": "call",
								"object": {
									"kind": "variable",
									"name": "М"
								},
								"method": "Количество",
								"args": []
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_МассивОчистить",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "М"
							},
							"expr": {
								"kind": "new",
								"type": "Массив",
								"args": []
							}
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 1
								}
							]
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Очистить",
							"args": []
						},
						{
							"kind": "return",
							"value": {
								"kind": "call",
								"object": {
									"kind": "variable",
									"name": "М"
								},
								"method": "Количество",
								"args": []
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_МассивУдалить",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "М"
							},
							"expr": {
								"kind": "new",
								"type": "Массив",
								"args": []
							}
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 10
								}
							]
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 20
								}
							]
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Удалить",
							"args": [
								{
									"kind": "number",
									"value": 0
								}
							]
						},
						{
							"kind": "return",
							"value": {
								"kind": "call",
								"object": {
									"kind": "variable",
									"name": "М"
								},
								"method": "Получить",
								"args": [
									{
										"kind": "number",
										"value": 0
									}
								]
							}
						}
					]
				}
			],
			"globals": []
		}
	}
}