{
	"irVersion": 1,
	"generator": {
		"tool": "1C Exporter",
		"version": "0.1"
	},
	"module": {
		"name": "ОбщийМодульТестов",
		"body": {
			"routines": [
				{
					"kind": "function",
					"name": "Тест_Булево",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "return",
							"value": {
								"kind": "binary",
								"op": "Равно",
								"left": {
									"kind": "boolean",
									"value": true
								},
								"right": {
									"kind": "boolean",
									"value": false
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Арифметика",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "return",
							"value": {
								"kind": "binary",
								"op": "Плюс",
								"left": {
									"kind": "number",
									"value": 2
								},
								"right": {
									"kind": "binary",
									"op": "Умножить",
									"left": {
										"kind": "number",
										"value": 2
									},
									"right": {
										"kind": "number",
										"value": 2
									}
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Сравнение",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "return",
							"value": {
								"kind": "binary",
								"op": "И",
								"left": {
									"kind": "binary",
									"op": "Больше",
									"left": {
										"kind": "number",
										"value": 5
									},
									"right": {
										"kind": "number",
										"value": 3
									}
								},
								"right": {
									"kind": "binary",
									"op": "Меньше",
									"left": {
										"kind": "number",
										"value": 1
									},
									"right": {
										"kind": "number",
										"value": 2
									}
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Строки",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "return",
							"value": {
								"kind": "binary",
								"op": "Плюс",
								"left": {
									"kind": "string",
									"value": "a"
								},
								"right": {
									"kind": "string",
									"value": "b"
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Переменная",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "а"
							},
							"expr": {
								"kind": "number",
								"value": 10
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "b"
							},
							"expr": {
								"kind": "binary",
								"op": "Плюс",
								"left": {
									"kind": "variable",
									"name": "а"
								},
								"right": {
									"kind": "number",
									"value": 5
								}
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "variable",
								"name": "b"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Структура",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Стр"
							},
							"expr": {
								"kind": "new",
								"type": "Структура",
								"args": [
									{
										"key": "Ключ",
										"value": {
											"kind": "number",
											"value": 123
										}
									}
								]
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Стр"
								},
								"property": "Ключ"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_СтруктураМногоКлючей",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Стр"
							},
							"expr": {
								"kind": "new",
								"type": "Структура",
								"args": [
									{
										"key": "Ключ1",
										"value": {
											"kind": "number",
											"value": 10
										}
									},
									{
										"key": "Ключ2",
										"value": {
											"kind": "number",
											"value": 20
										}
									}
								]
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "binary",
								"op": "Плюс",
								"left": {
									"kind": "member",
									"object": {
										"kind": "variable",
										"name": "Стр"
									},
									"property": "Ключ1"
								},
								"right": {
									"kind": "member",
									"object": {
										"kind": "variable",
										"name": "Стр"
									},
									"property": "Ключ2"
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Массив",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "М"
							},
							"expr": {
								"kind": "new",
								"type": "Массив",
								"args": []
							}
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 10
								}
							]
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 20
								}
							]
						},
						{
							"kind": "return",
							"value": {
								"kind": "binary",
								"op": "Плюс",
								"left": {
									"kind": "index",
									"object": {
										"kind": "variable",
										"name": "М"
									},
									"index": {
										"kind": "number",
										"value": 0
									}
								},
								"right": {
									"kind": "index",
									"object": {
										"kind": "variable",
										"name": "М"
									},
									"index": {
										"kind": "number",
										"value": 1
									}
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Если",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Сумма"
							},
							"expr": {
								"kind": "number",
								"value": 100
							}
						},
						{
							"kind": "if",
							"cond": {
								"kind": "binary",
								"op": "Больше",
								"left": {
									"kind": "variable",
									"name": "Сумма"
								},
								"right": {
									"kind": "number",
									"value": 150
								}
							},
							"then": [
								{
									"kind": "return",
									"value": {
										"kind": "string",
										"value": "Больше"
									}
								}
							],
							"else": [
								{
									"kind": "if",
									"cond": {
										"kind": "binary",
										"op": "Больше",
										"left": {
											"kind": "variable",
											"name": "Сумма"
										},
										"right": {
											"kind": "number",
											"value": 50
										}
									},
									"then": [
										{
											"kind": "return",
											"value": {
												"kind": "string",
												"value": "Средне"
											}
										}
									],
									"else": [
										{
											"kind": "return",
											"value": {
												"kind": "string",
												"value": "Меньше"
											}
										}
									]
								}
							]
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_ДляЦикл",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Сумма"
							},
							"expr": {
								"kind": "number",
								"value": 0
							}
						},
						{
							"kind": "for",
							"body": [
								{
									"kind": "assign",
									"target": {
										"kind": "variable",
										"name": "Сумма"
									},
									"expr": {
										"kind": "binary",
										"op": "Плюс",
										"left": {
											"kind": "variable",
											"name": "Сумма"
										},
										"right": {
											"kind": "variable",
											"name": "Индекс"
										}
									}
								}
							],
							"variable": "Индекс",
							"start": {
								"kind": "number",
								"value": 1
							},
							"end": {
								"kind": "number",
								"value": 5
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "variable",
								"name": "Сумма"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_ДляКаждогоЦикл",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "М"
							},
							"expr": {
								"kind": "new",
								"type": "Массив",
								"args": []
							}
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 1
								}
							]
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 2
								}
							]
						},
						{
							"kind": "call",
							"object": {
								"kind": "variable",
								"name": "М"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "number",
									"value": 3
								}
							]
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Сумма"
							},
							"expr": {
								"kind": "number",
								"value": 0
							}
						},
						{
							"kind": "foreach",
							"body": [
								{
									"kind": "assign",
									"target": {
										"kind": "variable",
										"name": "Сумма"
									},
									"expr": {
										"kind": "binary",
										"op": "Плюс",
										"left": {
											"kind": "variable",
											"name": "Сумма"
										},
										"right": {
											"kind": "variable",
											"name": "Элемент"
										}
									}
								}
							],
							"variable": "Элемент",
							"collection": {
								"kind": "variable",
								"name": "М"
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "variable",
								"name": "Сумма"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_ПокаЦикл",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "i"
							},
							"expr": {
								"kind": "number",
								"value": 1
							}
						},
						{
							"kind": "while",
							"body": [
								{
									"kind": "assign",
									"target": {
										"kind": "variable",
										"name": "i"
									},
									"expr": {
										"kind": "binary",
										"op": "Плюс",
										"left": {
											"kind": "variable",
											"name": "i"
										},
										"right": {
											"kind": "number",
											"value": 1
										}
									}
								}
							],
							"cond": {
								"kind": "binary",
								"op": "МеньшеИлиРавно",
								"left": {
									"kind": "variable",
									"name": "i"
								},
								"right": {
									"kind": "number",
									"value": 5
								}
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "variable",
								"name": "i"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Процедура",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Объект"
							},
							"expr": {
								"kind": "new",
								"type": "Структура",
								"args": [
									{
										"key": "Сумма",
										"value": {
											"kind": "number",
											"value": 100
										}
									},
									{
										"key": "НДС",
										"value": {
											"kind": "number",
											"value": 0
										}
									}
								]
							}
						},
						{
							"kind": "call",
							"name": "ВызватьПроцедуруТест",
							"args": [
								{
									"kind": "variable",
									"name": "Объект"
								}
							]
						},
						{
							"kind": "return",
							"value": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Объект"
								},
								"property": "НДС"
							}
						}
					]
				},
				{
					"kind": "procedure",
					"name": "ВызватьПроцедуруТест",
					"export": false,
					"params": [
						{
							"name": "Объект",
							"byValue": false,
							"defaultValue": null
						}
					],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Объект"
								},
								"property": "НДС"
							},
							"expr": {
								"kind": "binary",
								"op": "Умножить",
								"left": {
									"kind": "member",
									"object": {
										"kind": "variable",
										"name": "Объект"
									},
									"property": "Сумма"
								},
								"right": {
									"kind": "number",
									"value": 0.2
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Функция",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "return",
							"value": {
								"kind": "call",
								"name": "Удвоить",
								"args": [
									{
										"kind": "number",
										"value": 10
									}
								]
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Удвоить",
					"export": true,
					"params": [
						{
							"name": "ЗначПерем",
							"byValue": false,
							"defaultValue": null
						}
					],
					"body": [
						{
							"kind": "return",
							"value": {
								"kind": "binary",
								"op": "Умножить",
								"left": {
									"kind": "variable",
									"name": "ЗначПерем"
								},
								"right": {
									"kind": "number",
									"value": 2
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Попытка",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Результат"
							},
							"expr": {
								"kind": "string",
								"value": "Все ОК"
							}
						},
						{
							"kind": "try",
							"try": [
								{
									"kind": "throw",
									"value": {
										"kind": "string",
										"value": "Тестовое исключение"
									}
								}
							],
							"catch": [
								{
									"kind": "assign",
									"target": {
										"kind": "variable",
										"name": "Ошибка"
									},
									"expr": {
										"kind": "call",
										"name": "ИнформацияОбОшибке",
										"args": []
									}
								},
								{
									"kind": "assign",
									"target": {
										"kind": "variable",
										"name": "Результат"
									},
									"expr": {
										"kind": "binary",
										"op": "Плюс",
										"left": {
											"kind": "string",
											"value": "Возникала ошибка: "
										},
										"right": {
											"kind": "member",
											"object": {
												"kind": "variable",
												"name": "Ошибка"
											},
											"property": "Описание"
										}
									}
								}
							]
						},
						{
							"kind": "return",
							"value": {
								"kind": "variable",
								"name": "Результат"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_ТаблицаЗначений",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Таблица"
							},
							"expr": {
								"kind": "new",
								"type": "ТаблицаЗначений",
								"args": []
							}
						},
						{
							"kind": "call",
							"object": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Таблица"
								},
								"property": "Колонки"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "string",
									"value": "Номенклатура"
								}
							]
						},
						{
							"kind": "call",
							"object": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Таблица"
								},
								"property": "Колонки"
							},
							"method": "Добавить",
							"args": [
								{
									"kind": "string",
									"value": "Количество"
								}
							]
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Строка"
							},
							"expr": {
								"kind": "call",
								"object": {
									"kind": "variable",
									"name": "Таблица"
								},
								"method": "Добавить",
								"args": []
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Строка"
								},
								"property": "Номенклатура"
							},
							"expr": {
								"kind": "string",
								"value": "Товар1"
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Строка"
								},
								"property": "Количество"
							},
							"expr": {
								"kind": "number",
								"value": 10
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Строка"
							},
							"expr": {
								"kind": "call",
								"object": {
									"kind": "variable",
									"name": "Таблица"
								},
								"method": "Добавить",
								"args": []
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Строка"
								},
								"property": "Номенклатура"
							},
							"expr": {
								"kind": "string",
								"value": "Товар2"
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "member",
								"object": {
									"kind": "variable",
									"name": "Строка"
								},
								"property": "Количество"
							},
							"expr": {
								"kind": "number",
								"value": 20
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Сумма"
							},
							"expr": {
								"kind": "number",
								"value": 0
							}
						},
						{
							"kind": "foreach",
							"body": [
								{
									"kind": "assign",
									"target": {
										"kind": "variable",
										"name": "Сумма"
									},
									"expr": {
										"kind": "binary",
										"op": "Плюс",
										"left": {
											"kind": "variable",
											"name": "Сумма"
										},
										"right": {
											"kind": "member",
											"object": {
												"kind": "variable",
												"name": "ТекСтрока"
											},
											"property": "Количество"
										}
									}
								}
							],
							"variable": "ТекСтрока",
							"collection": {
								"kind": "variable",
								"name": "Таблица"
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "variable",
								"name": "Сумма"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_СтруктураВложенная",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Внутри"
							},
							"expr": {
								"kind": "new",
								"type": "Структура",
								"args": [
									{
										"key": "Значение",
										"value": {
											"kind": "number",
											"value": 100
										}
									}
								]
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Стр"
							},
							"expr": {
								"kind": "new",
								"type": "Структура",
								"args": [
									{
										"key": "Внешнее",
										"value": {
											"kind": "number",
											"value": 50
										}
									},
									{
										"key": "Внутреннее",
										"value": {
											"kind": "variable",
											"name": "Внутри"
										}
									}
								]
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "binary",
								"op": "Плюс",
								"left": {
									"kind": "member",
									"object": {
										"kind": "member",
										"object": {
											"kind": "variable",
											"name": "Стр"
										},
										"property": "Внутреннее"
									},
									"property": "Значение"
								},
								"right": {
									"kind": "member",
									"object": {
										"kind": "variable",
										"name": "Стр"
									},
									"property": "Внешнее"
								}
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Даты",
					"export": false,
					"params": [],
					"body": [
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Дата1"
							},
							"expr": {
								"kind": "call",
								"name": "Дата",
								"args": [
									{
										"kind": "string",
										"value": "20240101"
									}
								]
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Дата2"
							},
							"expr": {
								"kind": "call",
								"name": "Дата",
								"args": [
									{
										"kind": "string",
										"value": "20240110164500"
									}
								]
							}
						},
						{
							"kind": "assign",
							"target": {
								"kind": "variable",
								"name": "Разница"
							},
							"expr": {
								"kind": "binary",
								"op": "Минус",
								"left": {
									"kind": "variable",
									"name": "Дата2"
								},
								"right": {
									"kind": "variable",
									"name": "Дата1"
								}
							}
						},
						{
							"kind": "return",
							"value": {
								"kind": "variable",
								"name": "Разница"
							}
						}
					]
				}
			],
			"globals": []
		}
	}
}