{
	"irVersion": 1,
	"generator": {
		"tool": "1C Exporter",
		"version": "0.1"
	},
	"module": {
		"name": "ТестыБлок2",
		"body": {
			"routines": [
				{
					"kind": "function",
					"name": "Тест_Null",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "return",
							"value": {
								"kind": "null"
							}
						}
					]
				},
				{
					"kind": "function",
					"name": "Тест_Неопределено",
					"export": true,
					"params": [],
					"body": [
						{
							"kind": "return",
							"value": {
								"kind": "undefined"
							}
						}
					]
				}
			],
			"globals": []
		}
	}
}