
&НаКлиенте
Процедура Команда1(Команда)
	ВполнтитьТесты();
КонецПроцедуры

&НаСервере
Процедура ВполнтитьТесты()
	//ПутьКФайлу = "D:\PROJECTS\JsCRM\export\tests\CommonModule.ОбщийМодульТестов.results.json";
	//
	//Данные = ОбщийМодульТестов._IR_ВыполнитьТесты();
	//ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	//ЗаписьJSON = Новый ЗаписьJSON;
	//ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, "UTF-8", Ложь, ПараметрыJSON); 	
	//ЗаписатьJSON(ЗаписьJSON, Данные,,"ПреобразованиеНестандартныхТипов", ЭтотОбъект);
	//ЗаписьJSON.Закрыть();
	
	//2
	ПутьКФайлу = "D:\PROJECTS\JsCRM\export\tests\CommonModule.ТестыБлок1.results.json";
	
	Данные = ТестыБлок1._IR_ВыполнитьТесты();
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, "UTF-8", Ложь, ПараметрыJSON); 	
	ЗаписатьJSON(ЗаписьJSON, Данные,,"ПреобразованиеНестандартныхТипов", ЭтотОбъект);
	ЗаписьJSON.Закрыть();
	
	//ТестыБлок2
	ПутьКФайлу = "D:\PROJECTS\JsCRM\export\tests\CommonModule.ТестыБлок2.results.json";
	
	Данные = ТестыБлок2._IR_ВыполнитьТесты();
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, "UTF-8", Ложь, ПараметрыJSON); 	
	ЗаписатьJSON(ЗаписьJSON, Данные,,"ПреобразованиеНестандартныхТипов", ЭтотОбъект);
	ЗаписьJSON.Закрыть();
	
	//ТестыБлок3
	ПутьКФайлу = "D:\PROJECTS\JsCRM\export\tests\CommonModule.ТестыБлок3.results.json";
	
	Данные = ТестыБлок3._IR_ВыполнитьТесты();
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, "UTF-8", Ложь, ПараметрыJSON); 	
	ЗаписатьJSON(ЗаписьJSON, Данные,,"ПреобразованиеНестандартныхТипов", ЭтотОбъект);
	ЗаписьJSON.Закрыть();
	
	//ТестыБлок4
	ПутьКФайлу = "D:\PROJECTS\JsCRM\export\tests\CommonModule.ТестыБлок4.results.json";
	
	Данные = ТестыБлок4._IR_ВыполнитьТесты();
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, "UTF-8", Ложь, ПараметрыJSON); 	
	ЗаписатьJSON(ЗаписьJSON, Данные,,"ПреобразованиеНестандартныхТипов", ЭтотОбъект);
	ЗаписьJSON.Закрыть();
	
	//ТестыБлок5
	ПутьКФайлу = "D:\PROJECTS\JsCRM\export\tests\CommonModule.ТестыБлок5.results.json";
	
	Данные = ТестыБлок5._IR_ВыполнитьТесты();
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, "UTF-8", Ложь, ПараметрыJSON); 	
	ЗаписатьJSON(ЗаписьJSON, Данные,,"ПреобразованиеНестандартныхТипов", ЭтотОбъект);
	ЗаписьJSON.Закрыть();
	
	
	
КонецПроцедуры

&НаСервере
Функция ПреобразованиеНестандартныхТипов(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт 
    
    // ====================================================================
    // 1. NULL → {"kind": "null"}
    // ====================================================================
    Если Значение = NULL Тогда
        Значение = Неопределено;
    КонецЕсли;
        
    // ====================================================================
    // 2. УникальныйИдентификатор → {"kind": "uuid", "value": "..."}
    // ====================================================================
    Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
        СтрокаGUID = Строка(Значение);
        Возврат СтрокаGUID;
    КонецЕсли;
    
    Возврат Значение;
    
КонецФункции