
&НаКлиенте
Процедура Команда1(Команда)
	ВполнтитьТесты();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВполнтитьТесты()
	ПутьКФайлу = "D:\PROJECTS\JsCRM\export\tests\CommonModule.ОбщийМодульТестов.results.json";
	
	Данные = ОбщийМодульТестов._IR_ВыполнитьТесты();
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, "UTF-8", Ложь, ПараметрыJSON); 	
    ЗаписатьJSON(ЗаписьJSON, Данные);
	ЗаписьJSON.Закрыть();
КонецПроцедуры